package org.dblur.JarSoftTest;

import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;

@SpringBootApplication
public class JarSoftTestApplication {

	public static void main(String[] args) {
		SpringApplication.run(JarSoftTestApplication.class, args);
	}

	//TODO общий список:
	// - решить проблему с категориями баннеров при добавлении
	// - сделать edit баннеров
	// - сделать edit категорий
	// - сделать разметку на фронт
	// - сделать выпадающий список категорий при редактировании баннеров
	// - категорию нельзя удалить, если с ней связаны неудаленные баннеры
	// - поиск баннеров
	// - поиск категорий
	// - сообщения о валидации баннеров и категорий при создании
	// - сделать реквест
	// - понять как работает юзерагент
	// - доделать красивый фронт

	//TODO: сделать показ баннеров:
	// Для получения текста баннера используется URL вида: http://host:port/bid?category=<REQ_NAME.
	// В ответ приложение возвращает текст баннера из указанной в запросе категории.
	// При наличии нескольких баннеров с такой категорией долженвыбираться баннер с самой высокой ценой.
	// Если присутствует несколько баннеров с самой высокой ценой, то среди них выбирается случайный.
	// Если по данному запросу не нашлось ни одного баннера, то сервер должен вернуть HTTP status204.
	// Информация о каждом запросе должна записываться в таблицу requests.


}
